In [1]:
import pandas as pd

In [3]:
car_data = pd.read_csv("https://raw.githubusercontent.com/fahimshahariar1/Pandas/refs/heads/main/Resouces/car-sales.csv")

In [5]:
car_data

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## Describe Data

In [28]:
# Attributes
car_data.dtypes

#this attribute is used to learn about the  datatypes available in the dataset

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [10]:
car_data.columns
#columns will return all the columns in a dataset

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [14]:
car_data.index
#index would show how many indexes there are in the dataset

RangeIndex(start=0, stop=10, step=1)

In [18]:
car_data.describe()
#this is a function as you can see it has brackets. Descrinbe function helps us to get an statical overview of the datset

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [20]:
car_data.info()
#info function is basically a mix of columns and dtype attribute

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [22]:
car_data.mean(numeric_only = True)
#in order to get the mean value of a data set we need to use this command and pasing numeric_only=True is a must

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [26]:
car_data["Doors"].sum()
#similar to mean we can also call the sum function and we can also call the fucntion on a particular Column itself rather than the whole dataset

40